cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "awscli"
brew "fish"
brew "mas"
brew "ruby"
brew "tig"
brew "tmux"
brew "vim"

cask "google-chrome"
cask "google-japanese-ime"
cask "microsoft-office"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "appcleaner"
cask "iterm2"
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "docker"
cask "sequel-pro"
cask "slack"
cask "charles"
cask "drawio"

mas "1Password 7", id: 1333542190
mas "CotEditor", id: 1024640650
